README.tex
% Created 2016-08-14 日 22:20
\documentclass[a4paper,twoside,twocolumn]{bxjsarticle}
\usepackage{zxjatype}
\usepackage[ipa]{zxjafont}
\usepackage{xltxtra}
\usepackage{amsmath}
\usepackage{newtxtext,newtxmath}
\usepackage{graphicx}
\usepackage{hyperref}
\ifdefined\kanjiskip
\usepackage{pxjahyper}
\hypersetup{colorlinks=true}
\else
\ifdefined\XeTeXversion
\hypersetup{colorlinks=true}
\else
\ifdefined\directlua
\hypersetup{pdfencoding=auto,colorlinks=true}
\else
\hypersetup{unicode,colorlinks=true}
\fi
\fi
\fi

\usepackage{minted}
\usepackage[normalem]{ulem}
\author{産業技術大学院大学\\ 中鉢 欣秀}
\date{2016-08-14}
\title{GitHub入門}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\begin{abstract}
これはGitの初心者が，基礎的なGitコマンドの利用方法から，
GitHubフローに基づく協同開発の方法までを学ぶ演習である．

事前に gitコマンドが利用できる環境を用意しておくこと．
またCUI端末でのshellによる基本的な操作を知っていると
スムーズに演習ができる．

第1章はGit初心者（初めてさわる者）を対象に基礎を学ぶ．
第2章は個人によるGitHubの初歩的な使い方を取り扱う．
第3章ではチームによるGitHubの使い方を知ろう．
\end{abstract}

\section{Git入門}
\label{sec-1}
\subsection{Gitの設定}
\label{sec-1-1}
\subsubsection{Gitコマンドの実行確認}
\label{sec-1-1-1}
\begin{itemize}
\item 端末を操作してGitコマンドを起動してみよう．
\item 次のとおり操作することでGitのバージョン番号が確認できる．
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git --version
\end{minted}

\subsubsection{名前とメールアドレスの登録}
\label{sec-1-1-2}
\begin{itemize}
\item 名前とメールアドレスを登録しておく
\item 次のコマンドの\$NAMEと\$EMAILを各自の名前とメールアドレスに置き換えて実行せよ
\begin{itemize}
\item 名前はローマ字で設定すること
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git config --global user.name $NAME
git config --global user.email $EMAIL
\end{minted}

\subsubsection{その他の設定}
\label{sec-1-1-3}
\begin{itemize}
\item 次のとおり，設定を行っておく
\begin{itemize}
\item 1行目：色付きで表示を見やすく
\item 2行目：pushする方法（詳細省略）
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git config --global color.ui auto
git config --global push.default simple
\end{minted}

\subsubsection{設定の確認方法}
\label{sec-1-1-4}
\begin{itemize}
\item ここまでの設定を確認する
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git config -l
\end{minted}

\subsection{Gitのリポジトリ}
\label{sec-1-2}
\subsubsection{プロジェクト用のディレクトリ}
\label{sec-1-2-1}
\begin{itemize}
\item リポジトリとはプロジェクトでソースコードなどを
配置するディレクトリ
\item Gitのリポジトリバージョン管理ができるようになる
\item GitHubと連携させることで共同作業ができる
\end{itemize}

\subsubsection{Gitリポジトリを利用するには}
\label{sec-1-2-2}
\begin{itemize}
\item リポジトリを利用する方法には主に2種類ある
\begin{enumerate}
\item git initコマンドで初期化する方法
\item git cloneコマンドでGitHubから入手する方法
\end{enumerate}
\item 本章では1.について解説する（次章からは2.で行う）
\end{itemize}

\subsubsection{Gitリポジトリの初期化方法}
\label{sec-1-2-3}
\begin{itemize}
\item my\_projectディレクトリを作成し，
  Gitリポジトリとして初期化するコマンドは次のとおり
\begin{itemize}
\item 1〜2行目：ディレクトリを作成して移動
\item 3行目：ディレクトリをリポジトリとして初期化
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
mkdir ~/my_project
cd ~/my_project
git init
\end{minted}

\begin{itemize}
\item 以降の作業は作成したmy\_projectディレクトリで行うこと
\begin{itemize}
\item 現在のディレクトリは「pwd」コマンドで確認できる
\end{itemize}
\end{itemize}

\subsubsection{リポジトリの状態を確認する方法}
\label{sec-1-2-4}
\begin{itemize}
\item 現在のリポジトリの状態を確認するコマンドは次のとおり
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git status
\end{minted}

\begin{itemize}
\item このコマンドは頻繁に使用する
\item 何かうまく行かないことがあったら，このコマンドで状態を確認する癖を
つけるとよい
\begin{itemize}
\item 表示される内容の意味は徐々に覚えていけば良い
\end{itemize}
\end{itemize}

\subsubsection{「.git」ディレクトリを壊すべからず}
\label{sec-1-2-5}
\begin{itemize}
\item ティレクトリにリポジトリを作成すると「.git」という隠しディレクトリが
できる
\begin{itemize}
\item ls -aで確認できるが・・・
\end{itemize}
\item このディレクトリは絶対に， \uline{手動で変更してはならない}
\begin{itemize}
\item むろん，削除もしてはならない
\end{itemize}
\end{itemize}

\subsection{コミットの作成方法}
\label{sec-1-3}
\subsubsection{コミットについて}
\label{sec-1-3-1}
\begin{itemize}
\item Gitの用語における「コミット」とは，「ひとかたまりの作業」をいう
\begin{itemize}
\item 新しい機能を追加した，バグを直した，ドキュメントの内容を更新した，など
\end{itemize}
\item Gitは作業の履歴を，コミットを単位として管理する
\begin{itemize}
\item コミットは次々にリポジトリに追加されていき，これらを記録することで
バーションの管理ができる（古いバージョンに戻る，など）
\end{itemize}
\item コミットには，作業の内容を説明するメッセージをつける
\begin{itemize}
\item 更に，コミットには自動的にIDが振られることも覚えておくと良い
\end{itemize}
\end{itemize}

\subsubsection{READMEファイルの作成}
\label{sec-1-3-2}
\begin{itemize}
\item my\_projectリポジトリにREADMEファイルを作成してみよう
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
echo "My README file." > README
\end{minted}

\begin{itemize}
\item プロジェクトには \uline{必ずREADMEファイルを用意} しておくこと
\end{itemize}

\subsubsection{リポジトリの状態の確認}
\label{sec-1-3-3}
\begin{itemize}
\item git statusで現在のリポジトリの状態を確認する
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git status
\end{minted}

\begin{itemize}
\item 未追跡のファイル（Untracked files:）の欄に作成したREADMEファイルが
（赤色で）表示される
\end{itemize}

\subsubsection{変更内容のステージング}
\label{sec-1-3-4}
\begin{itemize}
\item コミットの一つ手前にステージングという段階がある
\begin{itemize}
\item 変更をコミットするためには，ステージングしなくてはならない
\item 新しいファイルをステージングすると，これ以降，
gitがそのファイルの変更を追跡する
\end{itemize}
\end{itemize}

\subsubsection{ステージングの実行}
\label{sec-1-3-5}
\begin{itemize}
\item 作成したREADMEファイルをステージングするには，次のコマンドを打つ
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git add .
\end{minted}

\begin{itemize}
\item 「git add」の「.（ピリオド）」を忘れないように
\begin{itemize}
\item ピリオドは，リポジトリにおけるすべての変更を意味する
\item 複数のファイルを変更した場合には，ファイル名を指定して
部分的にステージングすることもできる・・・
\begin{itemize}
\item が，このやりかたは好ましくない
\item 一度に複数の変更を行うのではなく，一つの変更を終えたら
こまめにコミットする
\end{itemize}
\end{itemize}
\end{itemize}

\subsubsection{ステージング後のリポジトリへの状態}
\label{sec-1-3-6}
\begin{itemize}
\item 再度，git statusコマンドで状態を確認しよう
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git status
\end{minted}

\begin{itemize}
\item コミットされる変更（Changes to be committed:）の欄に，READMEファイルが
（緑色で）表示されれば正しい結果である
\end{itemize}

\subsubsection{ステージングされた内容をコミットする}
\label{sec-1-3-7}
\begin{itemize}
\item ステージング段階にある変更内容をコミットする
\item コミットにはその内容を示すメッセージ文をつける
\item 「First commit」というメッセージをつけて新しいコミットを作成する
\begin{itemize}
\item 「-m」オプションはそれに続く文字列をメッセージとして付与することを
指示するもの
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git commit -m 'First commit'
\end{minted}

\subsubsection{コミット後の状態の確認}
\label{sec-1-3-8}
\begin{itemize}
\item コミットが正常に行われたことを確認する
\begin{itemize}
\item ここでもgit statusコマンドか活躍する
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git status
\end{minted}

\begin{itemize}
\item 「nothing to commit, \ldots{}」との表示から
コミットすべきものがない（＝過去の変更はコミットされた）ことが
わかる
\item この表示がでたら（無事コミットできたので）一安心してよい
\end{itemize}

\subsection{変更履歴の作成}
\label{sec-1-4}
\subsubsection{更なるコミットを作成する}
\label{sec-1-4-1}
\begin{itemize}
\item リポジトリで変更作業を行い，新しいコミットを追加する
\begin{itemize}
\item READMEファイルに新しい行を追加する
\end{itemize}
\item 次の\$NAMEをあなたの名前に変更して実行しなさい
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
echo $NAME >> README
\end{minted}

\begin{itemize}
\item 既存のファイルへの追加なので「>>」を用いていることに注意
\end{itemize}

\subsubsection{変更後の状態の確認}
\label{sec-1-4-2}
\begin{itemize}
\item リポジトリの状態をここでも確認する
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git status
\end{minted}

\begin{itemize}
\item コミットのためにステージされていない変更（Changes not staged for commit:）の
欄に，変更された（modified）ファイルとしてREADMEが表示される
\end{itemize}

\subsubsection{差分の確認}
\label{sec-1-4-3}
\begin{itemize}
\item トラックされているファイルの変更箇所を確認する
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git diff
\end{minted}

\begin{itemize}
\item 頭に「+」のある（緑色で表示された）行が新たに追加された内容を示す
\begin{itemize}
\item 削除した場合は「-」がつく
\end{itemize}
\end{itemize}

\subsubsection{新たな差分をステージングする}
\label{sec-1-4-4}
\begin{itemize}
\item 作成した差分をコミットできるようにするために，ステージング段階に上げる
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git add .
\end{minted}

\begin{itemize}
\item git statusを行い，READMEファイルが「Changed to be commited:」の欄に
（緑色で）表示されていることを確認する
\item ステージさせるとgit diffの結果が空になる
\begin{itemize}
\item この場合，「git diff --staged」で確認可能
\end{itemize}
\end{itemize}

\subsubsection{ステージングされた新しい差分のコミット}
\label{sec-1-4-5}
\begin{itemize}
\item 変更内容を示すメッセージとともにコミットする
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git commit -m 'Add my name'
\end{minted}

\subsection{履歴の確認}
\label{sec-1-5}
\subsubsection{バージョン履歴の確認}
\label{sec-1-5-1}
\begin{itemize}
\item これまでの変更作業の履歴を確認
\begin{itemize}
\item 2つのコミットが存在する
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git log
\end{minted}

\begin{itemize}
\item 各コミットごとに表示される内容
\begin{itemize}
\item コミットのID（commit に続く英文字と数字の列）
\item AuthorとDate
\item コミットメッセージ
\end{itemize}
\end{itemize}

\subsubsection{一つのファイルの履歴}
\label{sec-1-5-2}
\begin{itemize}
\item 将来，複数のファイルを履歴管理するようになったら特定のファイルの
履歴のみ確認したい
\item その場合，次のとおりにする
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git log --follow README
\end{minted}

\subsubsection{2つのコミットの比較}
\label{sec-1-5-3}
\begin{itemize}
\item 異なる２つのコミットの変更差分は次のコマンドで確認できる
\begin{itemize}
\item コミットのIDはlogで確認できる（概ね先頭4文字でよい）
\item ブランチごとの比較もできる（後述）
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git diff $COMMIT_ID_1 $COMMIT_ID_2
\end{minted}


\subsection{ブランチの使い方}
\label{sec-1-6}
\subsubsection{ブランチとは}
\label{sec-1-6-1}
\begin{itemize}
\item 「ひとまとまりの作業」を行う場所
\item ソースコードなどの編集作業を始める際には
必ず新しいブランチを作成する
\end{itemize}

\subsubsection{masterは大事なブランチ}
\label{sec-1-6-2}
\begin{itemize}
\item Gitリポジトリの初期化後，最初のコミットを行うとmasterブランチができる
\item 非常に重要なブランチであり，
ここで \uline{直接編集作業を行ってはならない}
\begin{itemize}
\item ただし，本演習や，個人でGitを利用する場合はこの限りではない
\end{itemize}
\end{itemize}

\subsubsection{ブランチの作成}
\label{sec-1-6-3}
\begin{itemize}
\item 新しいブランチ「new\_branch」を作成して，なおかつ，そのブランチに移動する
\begin{itemize}
\item 「-b」オプションで新規作成
\item オプションがなければ単なる移動（後述）
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git checkout -b new_branch
\end{minted}

\begin{itemize}
\item 本来，ブランチには「これから行う作業の内容」が分かるような名前を付ける
\end{itemize}

\subsubsection{ブランチの確認}
\label{sec-1-6-4}
\begin{itemize}
\item ブランチの一覧と現在のブランチを確認する
\begin{itemize}
\item もともとあるmasterと，新しく作成したnew\_branchが表示される
\item 
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git branch -vv
\end{minted}

\subsubsection{ブランチの移動}
\label{sec-1-6-5}

\begin{itemize}
\item ブランチ「new\_branch」に移動する
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git checkout new_branch
\end{minted}

\begin{itemize}
\item git branch -vvで現在のブランチを確認してみよう
\item git statusの一行目にも現在のブランチが表示される
\end{itemize}

\subsubsection{ブランチの削除}
\label{sec-1-6-6}

\begin{itemize}
\item 作成したブランチを削除する
\begin{itemize}
\item 1行目：一度masterブランチに移動する
\end{itemize}
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git checkout master
git branch -d new_branch
git branch -vv
\end{minted}


\subsection{その他のコマンド}
\label{sec-1-7}
\subsubsection{ステージング/コミットの修正}
\label{sec-1-7-1}
ファイルのステージングを取り消す

\begin{minted}[frame=single,linenos=true]{bash}
git reset $FILE
\end{minted}

\$COMMITより後のコミットの取り消し（ローカルは保存）

\begin{minted}[frame=single,linenos=true]{bash}
git reset $COMMIT
\end{minted}

\$COMMITより後のコミットの取り消し（ローカルの変更も破棄）

\begin{minted}[frame=single,linenos=true]{bash}
git reset --hard $COMMIT
\end{minted}

\section{未整理}
\label{sec-2}
\subsection{Gitリポジトリ}
\label{sec-2-1}
\subsubsection{基本的な git コマンド}
\label{sec-2-1-1}
新しくブランチを作成してチェックアウトする

\begin{minted}[frame=single,linenos=true]{bash}
git checkout -b some_new_feature
\end{minted}

ブランチをGitHubにpushする

\begin{minted}[frame=single,linenos=true]{bash}
git add .
git commit -m '（作業内容）'
git push -u origin some_new_feature
\end{minted}


\subsection{GitHubとは}
\label{sec-2-2}
\subsubsection{{\bfseries\sffamily TODO} Gitとは}
\label{sec-2-2-1}
\subsubsection{GitHubについて}
\label{sec-2-2-2}
\begin{itemize}
\item ソーシャルコーディングのためのクラウド環境
\begin{itemize}
\item \href{https://github.com/}{GitHub}
\item \href{http://github.co.jp/}{GitHub Japan}
\end{itemize}
\item GitHubが提供する主な機能
\begin{itemize}
\item GitHub flowによる協同開発
\item Pull requests
\item Issue / Wiki
\item コード解析
\end{itemize}
\end{itemize}

\subsubsection{GitHub Flow}
\label{sec-2-2-3}
\begin{itemize}
\item Git-flow
\begin{itemize}
\item GitHub が登場する以前、 Git-flow が提唱された
\item \href{http://nvie.com/posts/a-successful-git-branching-model/}{A successful Git branching model » nvie.com}
\end{itemize}
\item GitHub flow
\begin{itemize}
\item GitHub により、よりシンプルで強力なワークフローが可能に
\item \href{http://scottchacon.com/2011/08/31/github-flow.html}{GitHub Flow – Scott Chacon}
\item \href{https://gist.github.com/Gab-km/3705015}{GitHub Flow (Japanese translation)}
\end{itemize}
\end{itemize}

\subsubsection{{\bfseries\sffamily TODO} [後ろへ] GitHub flow におけるコンフリクトについて}
\label{sec-2-2-4}
\begin{itemize}
\item マージのコンフリクト
\begin{itemize}
\item GitHub に提出した Pull requests が自動的にマージできないこと
\end{itemize}
\item 基本的な対処法
\begin{itemize}
\item コンフリクトは、コードの同じ箇所を複数の人が別々に編集すると発生
\item 初心者は、演習の最初の方では「他人と同じファイルを編集しない」こと
にして、操作になれる
\item 上達したら積極的にコンフリクトを起こしてみて、その解決方法を学ぶ
\item Pull requests でコンフリクトが発生し、自動的にマージできない状態に
なったら、 その PR を送った人がコンフリクトを自分で解消する
\end{itemize}
\end{itemize}
\subsubsection{コラボレーターの追加}
\label{sec-2-2-5}

\begin{itemize}
\item GitHubのリポジトリをブラウザで開く．
\item Settings -> Collaborators を選ぶ
\item メンバーを招待する
\item 招待されたメンバーには確認のメールが届くので，リンクをクリックする
\end{itemize}

\subsubsection{コラボレーターがソースコードを入手する方法}
\label{sec-2-2-6}

下記の「ychubachi」の部分を代表者のアカウント名にする．
\begin{minted}[frame=single,linenos=true]{bash}
git clone ychubachi/ychubachi_2016_gem
\end{minted}

\begin{enumerate}
\item プルリクエストとマージ
\label{sec-2-2-6-1}

\begin{itemize}
\item ブランチがGitHubに登録されたことを確認し，Pull requestを作成する
\item Pull requestのレビューが済んだらマージする
\end{itemize}

\item ローカルのmaster を最新版にする
\label{sec-2-2-6-2}

\begin{itemize}
\item GitHubで行ったマージをローカルに反映させる
\end{itemize}

\begin{minted}[frame=single,linenos=true]{bash}
git checkout master
git pull
\end{minted}
\end{enumerate}

\subsubsection{GitHubでのコンフリクトの解消方法}
\label{sec-2-2-7}
\begin{enumerate}
\item 前提
\label{sec-2-2-7-1}
\begin{itemize}
\item new\_feature ブランチで作業中であり、最新の更新は commit 済
\end{itemize}

\item 操作（一例）
\label{sec-2-2-7-2}

\begin{minted}[frame=single,linenos=true]{bash}
git checkout master         # master をチェックアウト
git pull origin master      # 手元の master を最新版にする
git checkout new_feature    # 作業中のブランチに戻る
git merge master            # この後、コンフリクトを修正する
git push origin new_feature # 作業中のブランチを再度、push
\end{minted}
\end{enumerate}


\subsubsection{Gemの作成からGitHubへの登録まで}
\label{sec-2-2-8}

\begin{minted}[frame=single,linenos=true]{bash}
bundle gem ychubachi_2016_gem
cd ychubachi_2016_gem/
git commit -m 'Initial commit'
git create
git push -u origin master
\end{minted}

\section{演習}
\label{sec-3}
\subsection{ペアで行う GitHub}
\label{sec-3-1}
\subsubsection{ペアで GitHub を使ってみよう}
\label{sec-3-1-1}
\begin{enumerate}
\item 隣同士でペアを組む
\item レポジトリを作成する（どちらか一方）
\begin{itemize}
\item \texttt{bundle gem} でひな形を作る（初心者は Gem でなくても良い）
\end{itemize}
\item レポジトリの Collaborators に登録する
\item レポジトリに対して、次のことを行う
\begin{itemize}
\item Pull requests を利用してみる
\item Issue を利用してみる
\item Wiki を利用してみる
\end{itemize}
\end{enumerate}
\subsubsection{課題1}
\label{sec-3-1-2}
\begin{enumerate}
\item Pull request \& merge の作業を各自5回以上行う
\begin{itemize}
\item ディスカッションやコードレビューもやってみる
\end{itemize}
\item Issue を5個以上登録する
\begin{itemize}
\item Pull request による Issue の close なども試す
\end{itemize}
\item Wiki でページを作成する
\begin{itemize}
\item ページを5つ程度作成して、リンクも貼る
\end{itemize}
\item 以上が終わったペアはグループでの演習に進む
\begin{itemize}
\item 講師に申告すること
\end{itemize}
\end{enumerate}

\subsection{グループで行う GitHub}
\label{sec-3-2}
\subsubsection{課題：グループで GitHub (1)}
\label{sec-3-2-1}
\begin{enumerate}
\item ペアを2つ組み合わせて4人グループを作成する
\begin{itemize}
\item 課題1が終わったペアから順番にグループ編成
\end{itemize}
\item 作りたい Gem について相談して仕様を決める
\begin{itemize}
\item テーマはなんでも良い
\begin{itemize}
\item Web API を利用したコマンドラインツールなど
\end{itemize}
\item ある程度の役割分担も決めておく
\end{itemize}
\item レポジトリを作成する（代表者1名）
\begin{itemize}
\item コラボレーターを追加する
\end{itemize}
\item 今まで学んだ知識を活用して Gem を開発する
\end{enumerate}
\subsubsection{課題：グループで GitHub (2)}
\label{sec-3-2-2}
\begin{enumerate}
\item グルーブメンバーでGemを共同で作成する
\item GitHub Flow の実践
\item Travis CI によるテストの自動化
\item RubyGems.org への自動ディプロイ
\item その他、GitHub の各種機能の活用
\end{enumerate}

\section{Git解説}
\label{sec-4}
\subsection{解説}
\label{sec-4-1}
\begin{itemize}
\item gitにはブランチ（branch）の概念がある
\item 最初にあるのはmasterブランチ
\item masterは一番大切なブランチであり，常に正常に動作する状態にする
\item 新しい作業を開始するときは必ず新しいbranchを作る
\item 後に，作業内容をmasterに取り込む（merge）
\end{itemize}
\section{Git演習}
\label{sec-5}
\subsection{ブランチの作成}
\label{sec-5-1}
\subsubsection{課題}
\label{sec-5-1-1}

「new\_feature」ブランチを作成せよ

\begin{minted}[frame=single,linenos=true]{bash}
git checkout -b new_feature
\end{minted}

\subsubsection{確認}
\label{sec-5-1-2}
\begin{itemize}
\item 方法1) git status の結果の一行目が「On brunch new\_feature」になっていること
\item 方法2) git status の一行目が「On brunch new\_feature」になっていること
\end{itemize}


\section{GitHub演習（個人）}
\label{sec-6}
\subsection{アカウントの作成}
\label{sec-6-1}
\subsubsection{課題}
\label{sec-6-1-1}
\href{https://github.com/}{GitHub} にアカウントを作成せよ
\subsubsection{提出}
\label{sec-6-1-2}
TODO: Google form
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}